Revit 2026 API

# IFCTransformSetter Class

---

A state-based class that forces an extra transformation applied to objects being exported.

SystemObject Autodesk.Revit.DB.IFCIFCTransformSetter

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCTransformSetter : IDisposable
```
```vb
Public Class IFCTransformSetter
	Implements IDisposable
```
```cpp
public ref class IFCTransformSetter : IDisposable
```
```fsharp
type IFCTransformSetter =
    class
        interface IDisposable
    end
```

The IFCTransformSetter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a transform setter. |
|  | Dispose | Releases all resources used by the IFCTransformSetter |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Initialize | Initializes the transformation in the transform setter. |
|  | InitializeFromBoundingBox |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

IFC has a system of local placements; these are created from a set of transforms in Revit. Sometimes there is a need to create a 'fake' transform to get the right local placement structure for IFC. This class is intended to maintain the transformation for the duration that it is needed. To ensure that the lifetime of the object is correctly managed, you should declare an instance of this class as a part of a 'using' statement in C# or similar construct in other lanuguages.

#### Reference

Autodesk.Revit.DB.IFC Namespace